anachrocomputer/STM32_MCP4822/ArmDds.c
            flag = !flag;
            
            printf("millis() = %ld %d %d %s%d\n", millis(), adc8, midi, name, octave);
         }
         
         if (millis() >= frame) {
            frame = millis() + 40u;
            
            const uint16_t ana1 = analogRead(1) / 32;
            const uint16_t ana2 = analogRead(8) / 32;
            fillRect(0, 32, 127, 63, SSD1351_WHITE, SSD1351_BLACK);
            fillRect(1, 33, ana1, 47, SSD1351_BLUE, SSD1351_BLUE);
            fillRect(1, 48, ana2, 62, SSD1351_BLUE, SSD1351_BLUE);
            updscreen(32, 63);
         }
         
         Tick = 0;
      }
      
      if (UART1RxAvailable()) {
         const uint8_t ch = UART1RxByte();
         
         printf("UART1: %02x\n", ch);
         switch (ch) {
         case 'r':
         case 'R':
            setRect(0, 0, MAXX - 1, MAXY - 1, SSD1351_WHITE);
            updscreen(0, MAXY - 1);
            break;
         case 'q':
         case 'Q':
            setVline(MAXX / 4,       0, MAXY - 1, SSD1351_WHITE);
            setVline(MAXX / 2,       0, MAXY - 1, SSD1351_WHITE);
            setVline((MAXX * 3) / 4, 0, MAXY - 1, SSD1351_WHITE);
            setHline(0, MAXX - 1, MAXY / 4, SSD1351_WHITE);
            setHline(0, MAXX - 1, MAXY / 2, SSD1351_WHITE);
            setHline(0, MAXX - 1, (MAXY * 3) / 4, SSD1351_WHITE);
            updscreen(0, MAXY - 1);
            break;
         case 'g':
            digit = 0;
            x = digit * width;
            break;
         case 'h':
            digit = 1;
            x = digit * width;
            break;
         case 'i':
            digit = 2;
            x = digit * width;
            break;
         case 'j':
            digit = 3;
            x = digit * width;
            break;
         case 'k':
            digit = 4;
            x = digit * width;
            break;
         case 'l':
            digit = 5;
            x = digit * width;
            break;
         case '0':
            renderHexDigit(x, 0, style, colour);
            updscreen(0, 31);
            break;
         case '1':
            renderHexDigit(x, 1, style, colour);
            updscreen(0, 31);
            break;
         case '2':
            renderHexDigit(x, 2, style, colour);
            updscreen(0, 31);
            break;
         case '3':
            renderHexDigit(x, 3, style, colour);
            updscreen(0, 31);
            break;
         case '4':
            renderHexDigit(x, 4, style, colour);
            updscreen(0, 31);
            break;
         case '5':
            renderHexDigit(x, 5, style, colour);
            updscreen(0, 31);
            break;
         case '6':
            renderHexDigit(x, 6, style, colour);
            updscreen(0, 31);
            break;
         case '7':
            renderHexDigit(x, 7, style, colour);
            updscreen(0, 31);
            break;
         case '8':
            renderHexDigit(x, 8, style, colour);
            updscreen(0, 31);
            break;
         case '9':
            renderHexDigit(x, 9, style, colour);
            updscreen(0, 31);
            break;
         case 'a':
         case 'A':
            renderHexDigit(x, 0xA, style, colour);
            updscreen(0, 31);
            break;
         case 'b':
         case 'B':
            renderHexDigit(x, 0xB, style, colour);
            updscreen(0, 31);
            break;
         case 'c':
         case 'C':
            renderHexDigit(x, 0xC, style, colour);
            updscreen(0, 31);
            break;
         case 'd':
         case 'D':
            renderHexDigit(x, 0xD, style, colour);
            updscreen(0, 31);
            break;
         case 'e':
         case 'E':
            renderHexDigit(x, 0xE, style, colour);
            updscreen(0, 31);
            break;
         case 'f':
         case 'F':
            renderHexDigit(x, 0xF, style, colour);
            updscreen(0, 31);
            break;
         case '/':
            printf("analogRead = %d, %d\n", analogRead(1), analogRead(8));
            break;
         case '.':
            drawSegDP(x, style, colour);
            updscreen(0, 31);
            break;
         case ':':
            drawSegCN(x, style, colour);
            updscreen(0, 31);
            break;
         case 'v':
         case 'V':
            style = VFD_STYLE;
            colour = VFD_COLOUR;
            break;
         case 'w':
         case 'W':
            style = LED_DOT_STYLE;
            colour = LED_COLOUR;
            break;
         case 'x':
         case 'X':
            style = PANAPLEX_STYLE;
            colour = PANAPLEX_COLOUR;
            break;
         case 'y':
         case 'Y':
            style = LED_BAR_STYLE;
            colour = LED_COLOUR;
            break;
         case 'z':
         case 'Z':
            memset(Frame, 0, sizeof (Frame));
            updscreen(0, MAXY - 1);
            break;
         }
      }
   }
}

